OpenFoamCase/pitzDaily/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object controlDict;
}

application simpleFoam;

startFrom startTime;

startTime 300;

stopAt endTime;

endTime 301;

deltaT 1;

writeControl timeStep;

writeInterval 1;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression no;
timeFormat general;

timePrecision 6;

runTimeModifiable yes;
functions
{
  outletVelocity
  {
    type surfaces;
    functionObjectLibs
      (
        "libsampling.so"
      );
    writeControl timeStep;
    writeInterval 1;
    surfaceFormat raw;
    interpolationScheme cellPoint;
    fields
      (
        U
      );
    surfaces
      (
        outlet

        {
          type patch;
          patches
            (
              outlet
            );

        }
      );
  }
}

